tutorials/reactiveTransport/reactiveTransportFoam/2DGrainstoneBimolecular/system/controlDictReactiveTransport
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactiveTransportFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         TotalTime;

deltaT          runTimestep;

writeControl    adjustableRunTime;

writeInterval   WriteTimestep;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

runTimeModifiable yes;




// ************************************************************************* //
