tutorials/reactiveTransport/reactiveTransportFoam/2DGrainstoneBimolecular/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 -5e-6)
    (1e-3 0 -5e-6)
    (1e-3 5e-4 -5e-6)
    (0 5e-4 -5e-6)
    (0 0 5e-6)
    (1e-3 0 5e-6)
    (1e-3 5e-4 5e-6)
    (0 5e-4 5e-6)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (1000 500 1) simpleGrading (1 1 1)
);

edges           
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (3 7 6 2)
        );
    }
    inlet
    {
		type patch;
		faces
		(
	    	(0 4 7 3)
		);
    } 
    outlet
    {
		type patch;
		faces
		(
	   	(1 2 6 5)
		);
    }
    frontandback
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
