tutorials/reactiveTransport/reactiveTransportFoam/2DGrainstoneBimolecular/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    U
    {
        solver           BiCGStab;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0.1;
    }
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.1;
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration on;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

  
    Yi 
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.1;
    }
    
    YiFinal
    {
       $Yi
       relTol 0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;


    residualControl
    {
        p               1e-6;
        U               1e-6;
    } 
}

relaxationFactors
{
       U 0.3;
       p 0.3;
}




// ************************************************************************* //
